Revit 2026 API

# SiteLocationLongitude Property

---

The longitude of the site location.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Longitude { get; set; }
```
```vb
Public Property Longitude As Double
	Get
	Set
```
```cpp
public:
property double Longitude {
	double get ();
	void set (double value);
}
```
```fsharp
member Longitude : float with get, set
```

#### Property Value

Double The longitude, in radians between -PI and PI. If the value is not between -PI and PI, it will be shifted by multiples of 2PI until it is in range.

A property that contains the longitude of the site location. The value of this property is in radians between +PI and -PI. If the given value is not between -PI and PI, it will be shifted by multiples of 2PI until it is in range.

When setting this property:

  1. Revit will attempt to match the coordinates to a city it knows about, and if a match is found, will set the name accordingly.
  2. Revit will attempt to automatically adjust the time zone value to match the new Longitude value set using [!:Autodesk::Revit::DB::SunAndShadowSettings::CalculateTimeZone]. For some boundary cases, the time zone calculated may not be correct. You can set the TimeZone property directly to the correct value if necessary.
  3. Revit will attempt to automatically update the weather station associated with the coordinates.

#### Reference

SiteLocation Class

Autodesk.Revit.DB Namespace